{
  "data": [
    {
      "id": "0016",
      "coverImage": "/manga-cover/0016.jpg",
      "title": "Kingdom",
      "genres": ["Historical", "Drama", "Action"],
      "views": "11901",
      "description": "Millions of years have passed since the times of legends, when the worlds of man and gods were still the same. In these times it was the desires of man that moved the world. It is the era of the 500 year war: The warring states period. Kingdom is the story of a young boy named Shin who grew into a great general and all the trials and bloodshed that lead him there. "
    },
    {
      "id": "0013",
      "coverImage": "/manga-cover/0013.jpg",
      "title": "Boku No Hero Academia",
      "genres": [
        "Action",
        "Comedy",
        "Drama",
        "Fantasy",
        "School Life",
        "Sci-fi",
        "Shounen",
        "Supernatural"
      ],
      "views": "11808",
      "description": "Izuku Midoriya, a boy who wishes to become a hero like his idol, However, lacking a quirk makes him an easy target for bullying from his peers and his childhood friend. Eventually, the physical and emotional abuse escalates him to become emotionless. However, he gets accepted to U.A. High School after saving Katsuki from a villain. "
    },
    {
      "id": "0003",
      "coverImage": "/manga-cover/0003.jpg",
      "title": "That Time I Got Reincarnated as a Slime - Trinity in Tempest",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Drama",
        "Fantasy",
        "Shounen"
      ],
      "views": "11690",
      "description": "The new spinoff manga to the hit fantasy isekai series, developed by original creator Fuse! Against the odds, the little slime Rimiru has established his magical kingdom for all monsters, called Tempest, and it's thriving. But three visitors, Phos the fox girl, Stella the dragon girl, and Frey the winged girl, come to pay Tempest a visit, they're stunned at just how quickly it's developed."
    },
    {
      "id": "0020",
      "coverImage": "/manga-cover/0020.jpg",
      "title": "One Piece",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Drama",
        "Fantasy",
        "Shounen"
      ],
      "views": "11515",
      "description": "As a child, Monkey D. Luffy dreamed of becoming the King of the Pirates. But his life changed when he accidentally gained the power to stretch like rubber...at the cost of never being able to swim again! Now Luffy, with the help of a motley collection of nakama, is setting off in search of \"One Piece,\" said to be the greatest treasure in the world..."
    },
    {
      "id": "0005",
      "coverImage": "/manga-cover/0005.jpg",
      "title": "Tales Of Demons And Gods",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Drama",
        "Fantasy",
        "Harem",
        "Romance",
        "Shounen"
      ],
      "views": "11418",
      "description": "In his past life, Nie Li was the strongest Demon Spiritist and stood at the pinnacle of the martial world. However, he lost his life during the battle with the Sage Emperor and the Six Deity Ranked Beast.His soul was then brought back to when he was still 13 years old. Although he's the weakest in his class with the lowest talent at only Red soul realm, with the aid of the vast knowledge which he accumulated from his previous life, he trained faster then anyone. He aims to protect the city which in the coming future will be assaulted by beasts and end up destroyed, as well as protect his lover, friends and family who died in the beast assault. And to destroy the Sacred family whom abandon their duty and betrayed the city in his past life."
    },
    {
      "id": "0019",
      "coverImage": "/manga-cover/0019.jpg",
      "title": "The Seven Deadly Sins",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Fantasy",
        "Shounen",
        "Supernatural"
      ],
      "views": "11368",
      "description": "The \"Seven Deadly Sins\", a group of evil knights who conspired to overthrow the kingdom of Britannia, were said to have been eradicated by the Holy Knights, although some claim that they still live. Ten years later, the Holy Knights have staged a Coup d'etat and assassinated the king, becoming the new, tyrannical rulers of the kingdom. Elizabeth, the king's only daughter, sets out on a journey to find the \"Seven Deadly Sins\", and to enlist their help in taking back the kingdom."
    },
    {
      "id": "0017",
      "coverImage": "/manga-cover/0017.jpg",
      "title": "One-Punch Man",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Drama",
        "Sci-fi",
        "Seinen",
        "Supernatural"
      ],
      "views": "11261",
      "description": "In this new action-comedy, everything about a young man named Saitama screams \"AVERAGE,\" from his lifeless expression to his bald head, to his unimpressive physique. However, this average-looking fellow doesn't have your average problem... He's actually a superhero that's looking for tough opponents! The problem is, every time he finds a promising candidate he beats the snot out of them in one punch. Can Saitama finally find an evil villain strong enough to challenge him? Follow Saitama through his hilarious romps as he searches for new bad guys to challenge!"
    },
    {
      "id": "0008",
      "coverImage": "/manga-cover/0008.jpg",
      "title": "Kaiju No. 8",
      "genres": ["Action", "Comedy", "Horror", "Sci-fi", "Shounen"],
      "views": "10285",
      "description": "Kafka Hibino is a 32-year-old member of the Professional Kaiju Cleanup Corp. His job as a Monster Sweeper is to chop up and dispose of Kaiju killed by the Defense Force. Kafka was also childhood friends with Mina Ashiro who he made a vow with to join the Defense Force together and protect Japan from Kaiju. However, Kafka failed the entrance exam numerous times and quit on his dreams of being a member of the Defense Force while Mina went on to become the captain of the Defense Force’s 3rd Division."
    },
    {
      "id": "0009",
      "coverImage": "/manga-cover/0009.jpg",
      "title": "Bokura wa Minna Kawaisou",
      "genres": ["Comedy", "Romance", "School Life", "Seinen", "Slice of Life"],
      "views": "10143",
      "description": "Usa, a high-school student aspiring to begin a bachelor lifestyle, moves into a new apartment only to discover that he not only shares a room with a perverted roommate that has an obsession for underaged girls, but also that another girl, Ritsu, a love-at-first-sight, is living in the same building as well!"
    },
    {
      "id": "0010",
      "coverImage": "/manga-cover/0010.jpg",
      "title": "Mushoku Tensei - Isekai Ittara Honki Dasu",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Drama",
        "Fantasy",
        "Harem",
        "Isekai",
        "Romance",
        "Seinen"
      ],
      "views": "10112",
      "description": "Mushoku Tensei is a Japanese anime series based on the light novel series of the same title. It follows jobless and hopeless man who dies after having a sad and reclusive life and reincarnates in a fantasy world while keeping his memories, determined to enjoy his new life without regrets under the name Rudeus Greyrat."
    }
  ]
}
